[{"title":"My personal journey in learning how to code","permalink":"my-personal-journey-in-learning-how-to-code","postContent":"<p>\r\n                        11/25/19\r\n                        <br><br>\r\n                        &emsp;&emsp;My personal journey in learning how to code has not been a straight forward path.\r\n                        I’m sure that\r\n                        if you do a little searching, and read other’s stories, you will find that mine is not so\r\n                        different from theirs.\r\n                        <br><br>\r\n                        &emsp;&emsp;When I first got started I had no clue about how to even begin such a thing. I did\r\n                        some\r\n                        searching on line and found a mix of different approaches. If you had the money and you had the\r\n                        time, what was often suggested was to go to college and attempt a bachelors in computer science.\r\n                        If you didn’t have time but you had the money, they maybe a boot camp was the right thing. If\r\n                        you had time but you didn’t have money then there was plenty of free resources available.\r\n                        <br><br>\r\n                        &emsp;&emsp;I knew from the beginning that going back to college, as much as I wished I could\r\n                        go, was not an\r\n                        option. I just can not afford the price of higher education in my country. I also didn’t feel\r\n                        comfortable looking for a bootcamp. What was left was to try and put it all together through\r\n                        free resources.\r\n                        <br><br>\r\n                        &emsp;&emsp;Around November in 2017 is when I started looking. I would just search for things\r\n                        like “how to\r\n                        code”, “Can I learn to code in my 30’s”, or “what is coding”. I have used a computer almost my\r\n                        whole life, but it was at this moment that I had come to realize that I know nothing about\r\n                        computers. I thought I knew about them. I could find software that I needed, down load it\r\n                        without getting a virus, and install it onto my computer. If something was wrong I could search\r\n                        the problem and find solutions from forums. Then take those solutions and start applying them\r\n                        until it fixes the problem or I had come to learn how to live with the problem. But\r\n                        understanding any of the underlying mechanics to everything I was doing was just not part of my\r\n                        daily life at all. So when it came to actually trying to understand how to even begin learning\r\n                        about programming or development, I quickly realized that I was way out of my comfort zone.\r\n                        <br><br>\r\n                        &emsp;&emsp;Eventually I ended up plugging into a search engine “Free coding boot camp” and I\r\n                        got a hit for\r\n                        the website “Free Code Camp”. This is when I started to get traction into the whole thing. I\r\n                        think this was around December 2017 or January 2018. I don’t know for certain. I remember\r\n                        spending many hours looking and feeling like I wasn’t getting anywhere. FCC gave me a couple\r\n                        important things. For one, I was able to see a big picture view of what they had planned for\r\n                        their program. It took me a long time looking at everything until it finally clicked that\r\n                        “learning how to code” was not just learning one programming language, but rather large umbrella\r\n                        term that covers multiple technologies and languages. This was one of the first mental hurdles\r\n                        that I had to jump over. Coming to terms with the scope of what I was trying to accomplish.\r\n                        <br><br>\r\n                        &emsp;&emsp;I kept with FCC for about 2 months. During that time I bought a couple classes from\r\n                        Udemy that I\r\n                        thought would help me out. I saw some classes for making games in Unity. I feel like I did what\r\n                        a lot of people in my position did, saw videogames, saw coding, and realized that it was in C#\r\n                        which was my target language. I stopped FCC and focused on the Udemy classes for about another\r\n                        month or so. During all of this I was still actively searching question online and reading\r\n                        forums like r/learnprogramming. I never really understood what anyone was talking about but I\r\n                        felt compelled to keep reading the discussions.\r\n                        <br><br>\r\n                        &emsp;&emsp;By this time it was about March or April of 2018. I felt more confident about the\r\n                        scope of what\r\n                        I was trying to achieve. I ended up looping back around to the idea of a bootcamp. I felt\r\n                        discouraged by my own attempts to steer my learning path and felt like it was worth the\r\n                        financial investment to get into some sort of structured learning environment. There was a lot\r\n                        to choose from. Every search resulted in what look on the surface to be quality options. It\r\n                        wasn’t until I started reaching out to these schools did my opinion about them change. I knew\r\n                        what tech stack I wanted to use. That was the .NET tech stack. There wasn’t many bootcamps that\r\n                        focused on that. When I gathered up a list of all the ones that did I ranked them from most\r\n                        promising looking to least. I reached out, emailed, and made phone calls hoping to talk to the\r\n                        instructors and get a feel from who was teaching these bootcamps and what their approach was. I\r\n                        grew up when ITT tech and other for profit education facilities were everywhere. This was before\r\n                        we knew they were all scams and didn’t really teach anything. Back when they were coming to, the\r\n                        idea that a school would not have your best interest was ridiculous. I wasn’t going to get swept\r\n                        up on another one of those. I was shocked to find out that none of these boot camps would let me\r\n                        talk to the actual instructors. I could talk to the sales department and they told me that if I\r\n                        had any technical type questions I could give it to them and they would see if the instructor\r\n                        had time to answer. None of this sat right with me. Especially with the amount of money they\r\n                        were asking. Most were between $8-$15k.\r\n                        <br><br>\r\n                        &emsp;&emsp;I quickly exhausted my list. The sales department of each school made it easy for\r\n                        me. It wasn’t\r\n                        until I found Code Career Academy that I thought that a bootcamp was just not in the cards for\r\n                        me. I made contact through email and Jeff was quick to reply. We set up a time to talk about\r\n                        thing. When I asked about speaking with the instructor he told me that he was the instructor. I\r\n                        was delighted. We ended up talking for about an hour and left the conversation feeling very\r\n                        confident about the program. During this time I was gearing up to start working for a software\r\n                        development company as a QA tester that would also do random intern type work. The pay was not\r\n                        the greatest but it also wasn’t terrible. Both the school and the work started at around July\r\n                        2018. The school was a series of recorded lectures that I could follow along at any time and I\r\n                        was able to schedule one on one time with the instructor Jeff.\r\n                        <br><br>\r\n                        &emsp;&emsp;Once I got into my full time job I realized that I would have to switch things up a\r\n                        bit. The\r\n                        demands of the job had me learning SQL and VB first. This was something that I was not prepared\r\n                        for. It just goes to show that you can do all the research in the world and it would not be\r\n                        enough to prepare you for the first job you get. A lot of my work required me to preform tasks\r\n                        on a piece of software in development then go into the actual database and confirm that\r\n                        everything I was doing in the program was also happening in the database. I put the school on\r\n                        hold and through a series of Udemy classes and digital books I started to focus on this new\r\n                        focus. It was not all in vain. I ended up having a better understanding of what a database is,\r\n                        how it works with an application, and how to navigate my way through a relational database. It\r\n                        gave me a different perspective of the broad field of software development. I also found it\r\n                        interesting working with the older legacy applications that required me to learn VB.\r\n                        <br><br>\r\n                        &emsp;&emsp;This whole endeavor ended up taking me away from CCA for about a year. It was just\r\n                        all too much\r\n                        for my brain to take in at once. Starting a new job, learning the ropes, and learning SQL with\r\n                        some VB. At around September I ended up looping back to the course material that I bought from\r\n                        Jeff and CCA. It was originally recorded in November 2017, so at this time it was about 2 years\r\n                        old but I feel like 99% of it is still relevant. There is a couple blog posts and reference\r\n                        links in the slides that are dead links, but besides that nothing much had changed since\r\n                        original filming.\r\n                        <br><br>\r\n                        &emsp;&emsp;So there I was in September 2019, starting at the beginning of a web development\r\n                        path, looking\r\n                        at HTML. I felt a lot better about it this time. Mostly because I have spent a great deal of\r\n                        time looking at the development life of web applications and the process involved with bringing\r\n                        them from a specification sheet to a deployed and working product. I realized that was what was\r\n                        holding me back by a lot. All the background information that people obtain just from being\r\n                        involved with it. The posts on web forums was making more sense, the topics being discussed I\r\n                        feel like I could make parallels with real world applications, and the terminology being used\r\n                        was actually registering with me.\r\n                        <br><br>\r\n                        &emsp;&emsp;I’ve been working on the CCA course material for about 3 months. I’m just about\r\n                        halfway through\r\n                        the front-end portion of that course. We have been working on static pages and are just dipping\r\n                        our toes into the idea of dynamic pages and server side processing. I hope to finish it up by\r\n                        the end of the year and start work on the back end part of class.\r\n                    </p>","date":"2019-11-25"},{"title":"Little tool to help along the way","permalink":"little-tool-to-help-along-the-way","postContent":"<p>\r\n                        11/25/19\r\n                        <br><br>\r\n                        &emsp;&emsp;I want to talk about something that I feel has been really helpful for me in\r\n                        learning how to\r\n                        code. I have created a time sheet that I use for recording the time spent on learning how to\r\n                        code. I feel that it has helped me have something tangible to look at when I have felt off about\r\n                        my progress. Also it has given me insight into my behaviors and habits when it comes to a ‘do at\r\n                        your own pace’ style of education.\r\n                        <br><br>\r\n                        &emsp;&emsp;There isn’t much to the time sheet. When I sit down to work on my education I set a\r\n                        topic, write\r\n                        down a start time, and record an end time when I wrap up. I don’t exclude minor breaks of 5 or\r\n                        10 minutes, but if I end up walking away for longer I will record the stop time and the start\r\n                        time again for when I get back. When I finish, I record in a spreadsheet the date, the title or\r\n                        topic of study, the general field (ie: front-end, back-end, etc), the total time spent, and a\r\n                        very brief overview of what was accomplished. About a sentence or two for the overview. I then\r\n                        choose a day like Sunday to call the end of my week. At this time I place a divider in the next\r\n                        available record, record the date range, and tally the total hours spent on this range.\r\n                        <br><br>\r\n                        &emsp;&emsp;What this has done for me is give me something tangible to reference when it comes\r\n                        to my time\r\n                        committed to learning. If I feel down or unassured about my commitment, I can look at every\r\n                        thing that I have logged to get a sense of how many steps have been put towards this path. I can\r\n                        also look at it and know for certain how long it has been since I have last committed effort to\r\n                        it or if I have been low on hours for the week.\r\n                        <br><br>\r\n                        &emsp;&emsp;An unintended side effect of this practice it the ability to tell myself that ‘Now\r\n                        is time for\r\n                        study’. It’s easy to be wishy washy about committing to self-driven education. You can be at the\r\n                        computer, your material pulled up on screen, and just kind of be half into it. With a topic or\r\n                        goal written down and stating a ‘start time’ it sends the same signal to your brain like a start\r\n                        pistol being fired, or the gate opening in front of a race horse. I am not committed to what I\r\n                        am doing, and I know that if I walk away for more then a short break that the clock stops and\r\n                        nothing is being contributed to this goal.\r\n                        <br><br>\r\n                        &emsp;&emsp;If you are undergoing the process of learning, then I would recommend the practice\r\n                        that I have\r\n                        just outlined. It takes very little time, but delivers great rewards. I helps give the student\r\n                        something to look at that offers not only support in the learning process but also possible\r\n                        insight into patters or deficiencies. You could also obtain the benefit of being able to switch\r\n                        your brain into a learning focused mindset and help keep you focused and goal oriented.\r\n                        <br><br>\r\n                    </p>","date":"2019-11-25"},{"title":"Stick with the material you picked","permalink":"stick-with-the-material-you-picked","postContent":"<p>\r\n                        11/25/19\r\n                        <br><br>\r\n                        &emsp;&emsp;I think it can be pretty easy getting overwhelmed by the amount of learning material\r\n                        out there on the internet. It can almost be too much at times. It’s important that once you have\r\n                        found something you think will give you a decent education, to stick with it. More times then\r\n                        not, the benefit of sticking with your class work outweighs the possible gain of that new\r\n                        material. It could be a situation where the grass looks greener on the other side.\r\n                        <br><br>\r\n                        &emsp;&emsp;I have to fight this urge a lot. When I am reading forums about learning\r\n                        programming, there are\r\n                        many suggestions on what to learn and where to learn it from. The reviews sound great and many\r\n                        people are reporting similar results. You might want to abandon or side track what you are\r\n                        currently on for the chance to also experience what these people are talking about.\r\n                        <br><br>\r\n                        &emsp;&emsp;I would strongly urge you not to. Go ahead, book mark it, put it on a list, make a\r\n                        note about it\r\n                        for later. All those are fine, but stick with your current material and see it all the way\r\n                        through. There is the reward and benefit of seeing something to completion that a new piece of\r\n                        education material can not give you at first. You originally picked what you are on for a\r\n                        reason. See it through to the end and reap the benefits of that reason you first saw in it.\r\n                    </p>","date":"2019-11-25"}]