[
    {
        "title": "My personal journey in learning how to code",
        "permalink": "my-personal-journey-in-learning-how-to-code",
        "postContent": "<p>&emsp;&emsp;My personal journey in learning how to code has not been a straight forward path.I’m sure thatif you do a little searching, and read other’s stories, you will find that mine is not sodifferent from theirs.<br><br>&emsp;&emsp;When I first got started I had no clue about how to even begin such a thing. I didsomesearching on line and found a mix of different approaches. If you had the money and you had thetime, what was often suggested was to go to college and attempt a bachelors in computer science.If you didn’t have time but you had the money, they maybe a boot camp was the right thing. Ifyou had time but you didn’t have money then there was plenty of free resources available.<br><br>&emsp;&emsp;I knew from the beginning that going back to college, as much as I wished I couldgo, was not anoption. I just can not afford the price of higher education in my country. I also didn’t feelcomfortable looking for a bootcamp. What was left was to try and put it all together throughfree resources.<br><br>&emsp;&emsp;Around November in 2017 is when I started looking. I would just search for thingslike “how tocode”, “Can I learn to code in my 30’s”, or “what is coding”. I have used a computer almost mywhole life, but it was at this moment that I had come to realize that I know nothing aboutcomputers. I thought I knew about them. I could find software that I needed, down load itwithout getting a virus, and install it onto my computer. If something was wrong I could searchthe problem and find solutions from forums. Then take those solutions and start applying themuntil it fixes the problem or I had come to learn how to live with the problem. Butunderstanding any of the underlying mechanics to everything I was doing was just not part of mydaily life at all. So when it came to actually trying to understand how to even begin learningabout programming or development, I quickly realized that I was way out of my comfort zone.<br><br>&emsp;&emsp;Eventually I ended up plugging into a search engine “Free coding boot camp” and Igot a hit forthe website “Free Code Camp”. This is when I started to get traction into the whole thing. Ithink this was around December 2017 or January 2018. I don’t know for certain. I rememberspending many hours looking and feeling like I wasn’t getting anywhere. FCC gave me a coupleimportant things. For one, I was able to see a big picture view of what they had planned fortheir program. It took me a long time looking at everything until it finally clicked that“learning how to code” was not just learning one programming language, but rather large umbrellaterm that covers multiple technologies and languages. This was one of the first mental hurdlesthat I had to jump over. Coming to terms with the scope of what I was trying to accomplish.<br><br>&emsp;&emsp;I kept with FCC for about 2 months. During that time I bought a couple classes fromUdemy that Ithought would help me out. I saw some classes for making games in Unity. I feel like I did whata lot of people in my position did, saw videogames, saw coding, and realized that it was in C#which was my target language. I stopped FCC and focused on the Udemy classes for about anothermonth or so. During all of this I was still actively searching question online and readingforums like r/learnprogramming. I never really understood what anyone was talking about but Ifelt compelled to keep reading the discussions.<br><br>&emsp;&emsp;By this time it was about March or April of 2018. I felt more confident about thescope of whatI was trying to achieve. I ended up looping back around to the idea of a bootcamp. I feltdiscouraged by my own attempts to steer my learning path and felt like it was worth thefinancial investment to get into some sort of structured learning environment. There was a lotto choose from. Every search resulted in what look on the surface to be quality options. Itwasn’t until I started reaching out to these schools did my opinion about them change. I knewwhat tech stack I wanted to use. That was the .NET tech stack. There wasn’t many bootcamps thatfocused on that. When I gathered up a list of all the ones that did I ranked them from mostpromising looking to least. I reached out, emailed, and made phone calls hoping to talk to theinstructors and get a feel from who was teaching these bootcamps and what their approach was. Igrew up when ITT tech and other for profit education facilities were everywhere. This was beforewe knew they were all scams and didn’t really teach anything. Back when they were coming to, theidea that a school would not have your best interest was ridiculous. I wasn’t going to get sweptup on another one of those. I was shocked to find out that none of these boot camps would let metalk to the actual instructors. I could talk to the sales department and they told me that if Ihad any technical type questions I could give it to them and they would see if the instructorhad time to answer. None of this sat right with me. Especially with the amount of money theywere asking. Most were between $8-$15k.<br><br>&emsp;&emsp;I quickly exhausted my list. The sales department of each school made it easy forme. It wasn’tuntil I found Code Career Academy that I thought that a bootcamp was just not in the cards forme. I made contact through email and Jeff was quick to reply. We set up a time to talk aboutthing. When I asked about speaking with the instructor he told me that he was the instructor. Iwas delighted. We ended up talking for about an hour and left the conversation feeling veryconfident about the program. During this time I was gearing up to start working for a softwaredevelopment company as a QA tester that would also do random intern type work. The pay was notthe greatest but it also wasn’t terrible. Both the school and the work started at around July2018. The school was a series of recorded lectures that I could follow along at any time and Iwas able to schedule one on one time with the instructor Jeff.<br><br>&emsp;&emsp;Once I got into my full time job I realized that I would have to switch things up abit. Thedemands of the job had me learning SQL and VB first. This was something that I was not preparedfor. It just goes to show that you can do all the research in the world and it would not beenough to prepare you for the first job you get. A lot of my work required me to preform taskson a piece of software in development then go into the actual database and confirm thateverything I was doing in the program was also happening in the database. I put the school onhold and through a series of Udemy classes and digital books I started to focus on this newfocus. It was not all in vain. I ended up having a better understanding of what a database is,how it works with an application, and how to navigate my way through a relational database. Itgave me a different perspective of the broad field of software development. I also found itinteresting working with the older legacy applications that required me to learn VB.<br><br>&emsp;&emsp;This whole endeavor ended up taking me away from CCA for about a year. It was justall too muchfor my brain to take in at once. Starting a new job, learning the ropes, and learning SQL withsome VB. At around September I ended up looping back to the course material that I bought fromJeff and CCA. It was originally recorded in November 2017, so at this time it was about 2 yearsold but I feel like 99% of it is still relevant. There is a couple blog posts and referencelinks in the slides that are dead links, but besides that nothing much had changed sinceoriginal filming.<br><br>&emsp;&emsp;So there I was in September 2019, starting at the beginning of a web developmentpath, lookingat HTML. I felt a lot better about it this time. Mostly because I have spent a great deal oftime looking at the development life of web applications and the process involved with bringingthem from a specification sheet to a deployed and working product. I realized that was what washolding me back by a lot. All the background information that people obtain just from beinginvolved with it. The posts on web forums was making more sense, the topics being discussed Ifeel like I could make parallels with real world applications, and the terminology being usedwas actually registering with me.<br><br>&emsp;&emsp;I’ve been working on the CCA course material for about 3 months. I’m just abouthalfway throughthe front-end portion of that course. We have been working on static pages and are just dippingour toes into the idea of dynamic pages and server side processing. I hope to finish it up bythe end of the year and start work on the back end part of class.</p>",
        "date": "2019-11-25"
    },
    {
        "title": "Little tool to help along the way",
        "permalink": "little-tool-to-help-along-the-way",
        "postContent": "<p>&emsp;&emsp;I want to talk about something that I feel has been really helpful for me inlearning how tocode. I have created a time sheet that I use for recording the time spent on learning how tocode. I feel that it has helped me have something tangible to look at when I have felt off aboutmy progress. Also it has given me insight into my behaviors and habits when it comes to a ‘do atyour own pace’ style of education.<br><br>&emsp;&emsp;There isn’t much to the time sheet. When I sit down to work on my education I set atopic, writedown a start time, and record an end time when I wrap up. I don’t exclude minor breaks of 5 or10 minutes, but if I end up walking away for longer I will record the stop time and the starttime again for when I get back. When I finish, I record in a spreadsheet the date, the title ortopic of study, the general field (ie: front-end, back-end, etc), the total time spent, and avery brief overview of what was accomplished. About a sentence or two for the overview. I thenchoose a day like Sunday to call the end of my week. At this time I place a divider in the nextavailable record, record the date range, and tally the total hours spent on this range.<br><br>&emsp;&emsp;What this has done for me is give me something tangible to reference when it comesto my timecommitted to learning. If I feel down or unassured about my commitment, I can look at everything that I have logged to get a sense of how many steps have been put towards this path. I canalso look at it and know for certain how long it has been since I have last committed effort toit or if I have been low on hours for the week.<br><br>&emsp;&emsp;An unintended side effect of this practice it the ability to tell myself that ‘Nowis time forstudy’. It’s easy to be wishy washy about committing to self-driven education. You can be at thecomputer, your material pulled up on screen, and just kind of be half into it. With a topic orgoal written down and stating a ‘start time’ it sends the same signal to your brain like a startpistol being fired, or the gate opening in front of a race horse. I am not committed to what Iam doing, and I know that if I walk away for more then a short break that the clock stops andnothing is being contributed to this goal.<br><br>&emsp;&emsp;If you are undergoing the process of learning, then I would recommend the practicethat I havejust outlined. It takes very little time, but delivers great rewards. I helps give the studentsomething to look at that offers not only support in the learning process but also possibleinsight into patters or deficiencies. You could also obtain the benefit of being able to switchyour brain into a learning focused mindset and help keep you focused and goal oriented.<br><br></p>",
        "date": "2019-11-25"
    },
    {
        "title": "Stick with the material you picked",
        "permalink": "stick-with-the-material-you-picked",
        "postContent": "<p>&emsp;&emsp;I think it can be pretty easy getting overwhelmed by the amount of learning materialout there on the internet. It can almost be too much at times. It’s important that once you havefound something you think will give you a decent education, to stick with it. More times thennot, the benefit of sticking with your class work outweighs the possible gain of that newmaterial. It could be a situation where the grass looks greener on the other side.<br><br>&emsp;&emsp;I have to fight this urge a lot. When I am reading forums about learningprogramming, there aremany suggestions on what to learn and where to learn it from. The reviews sound great and manypeople are reporting similar results. You might want to abandon or side track what you arecurrently on for the chance to also experience what these people are talking about.<br><br>&emsp;&emsp;I would strongly urge you not to. Go ahead, book mark it, put it on a list, make anote about itfor later. All those are fine, but stick with your current material and see it all the waythrough. There is the reward and benefit of seeing something to completion that a new piece ofeducation material can not give you at first. You originally picked what you are on for areason. See it through to the end and reap the benefits of that reason you first saw in it.</p>",
        "date": "2019-11-25"
    }
]